import React, { useState } from 'react';
import { useNavigate } from 'react-router-dom';



function License() {
 const navigate = useNavigate();
  return (

    
    <div className="flex items-center justify-center min-h-screen bg-yellow-100">
        <button
        onClick={() => navigate('/')}
        className="absolute top-20 left-50 rounded-full p-2"
      >
        <img src={`${import.meta.env.BASE_URL}/image/back-button.png`} className="w-14 h-14 cursor-pointer" />
      </button>

      <div className="bg-purple-200 p-8 rounded-2xl shadow-lg w-200">
        <h1 className="text-black text-xl font-[Mali] mb-4">ข้อตกลงในการใช้ซอฟต์แวร์</h1>
        <p className="text-gray-700 font-[Mali]">ซอฟต์แวร์นี้เป็นผลงานที่พัฒนาขึ้นโดย นายกันตินันท์ ขุนพิลึก นายพชรพล พินิจกิจ และ นางสาวมนัสนันท์ ปานประเสริฐ จากโรงเรียนราชวินิตบางแก้ว ภายใต้การดูแลของนางสาว วนิดา มุสิแก้ว ภายใต้โครงการ CyberSmart ซึ่งได้รับการสนับสนุนโดยสำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ (สวทช.)

โดยมีวัตถุประสงค์เพื่อส่งเสริมให้นักเรียนและนักศึกษาได้เรียนรู้และฝึกทักษะในการพัฒนาซอฟต์แวร์ ทั้งนี้ ลิขสิทธิ์ของซอฟต์แวร์นี้เป็นของผู้พัฒนา ซึ่งผู้พัฒนาได้อนุญาตให้สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติเผยแพร่ซอฟต์แวร์นี้ในรูปแบบ “ต้นฉบับ” โดยไม่มีการแก้ไขดัดแปลงใด ๆ ทั้งสิ้น ให้บุคคลทั่วไปสามารถนำไปใช้เพื่อประโยชน์ส่วนบุคคลหรือประโยชน์ทางการศึกษา ที่ไม่มีวัตถุประสงค์ในเชิงพาณิชย์ โดยไม่คิดค่าตอบแทนการใช้ซอฟต์แวร์ดังกล่าว

    ดังนั้น สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติจะไม่รับผิดชอบในการดูแล บำรุงรักษา จัดการอบรมการใช้งาน หรือพัฒนาประสิทธิภาพของซอฟต์แวร์ รวมทั้งไม่รับรองความถูกต้องหรือประสิทธิภาพการทำงานของซอฟต์แวร์ ตลอดจนไม่รับประกันความเสียหายใด ๆ ที่อาจเกิดขึ้นจากการใช้งานซอฟต์แวร์นี้ทั้งสิ้น</p>
      </div>
    </div>


  );
}

export default License;
